In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('marks.csv')

In [3]:
data

    name  college_id  duration  marks  time_before_college  caff  semester
0   abhi           1         2     40                   10   100         1
1   eric           1         4     50                   20   200         2
2   jack           1         2      5                    5   400         3
3   amit           1         2     50                   10    10         1
4  krish           1         4     60                   20   100         2

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   name                 5 non-null      object
 1   college_id           5 non-null      int64
 2   duration             5 non-null      int64
 3   marks                5 non-null      int64
 4   time_before_college  5 non-null      int64
 5   caff                 5 non-null      int64
 6   semester             5 non-null      int64
dtypes: int64(6), object(1)
memory usage: 408.0+ bytes

In [5]:
data.describe()

,college_id,duration,marks,time_before_college,caff,semester
count,5.0,5.000000,5.000000,5.000000,5.000000,5.00000
mean,1.0,2.800000,41.000000,13.000000,162.000000,1.80000
std,0.0,1.095445,21.330729,6.708204,149.063745,0.83666
min,1.0,2.000000,5.000000,5.000000,10.000000,1.00000
25%,1.0,2.000000,40.000000,10.000000,100.000000,1.00000
50%,1.0,2.000000,50.000000,10.000000,100.000000,2.00000
75%,1.0,4.000000,50.000000,20.000000,200.000000,2.00000
max,1.0,4.000000,60.000000,20.000000,400.000000,3.00000

In [6]:
data.head()

    name  college_id  duration  marks  time_before_college  caff  semester
0   abhi           1         2     40                   10   100         1
1   eric           1         4     50                   20   200         2
2   jack           1         2      5                    5   400         3
3   amit           1         2     50                   10    10         1
4  krish           1         4     60                   20   100         2

In [7]:
y = data['marks']

In [8]:
y

0    40
1    50
2     5
3    50
4    60
Name: marks, dtype: int64

In [9]:
X = data[['college_id','duration','time_before_college','caff','semester']]

In [10]:
X

   college_id  duration  time_before_college  caff  semester
0           1         2                   10   100         1
1           1         4                   20   200         2
2           1         2                    5   400         3
3           1         2                   10    10         1
4           1         4                   20   100         2

In [11]:
from sklearn.linear_model import Lasso

In [12]:
from sklearn.feature_selection import SelectFromModel

In [13]:
model = SelectFromModel(Lasso())

In [14]:
model.fit(X,y)

SelectFromModel(estimator=Lasso(alpha=1.0, copy_X=True, fit_intercept=True,
                                max_iter=1000, normalize=False, positive=False,
                                precompute=False, random_state=None,
                                selection='cyclic', tol=0.0001,
                                warm_start=False),
                max_features=None, norm_order=1, prefit=False, threshold=None)

In [15]:
model.get_support()
# Gives wrong answer due to less data.

array([False, False,  True,  True, False])

In [16]:
# If less data,
model_1 = SelectFromModel(Lasso(alpha = 0.01))

In [17]:
model_1.fit(X,y)

/home/sid/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/_coordinate_descent.py:476: ConvergenceWarning: Objective did not converge. You might want to increase the number of iterations. Duality gap: 0.357863507705263, tolerance: 0.182
  positive)

SelectFromModel(estimator=Lasso(alpha=0.01, copy_X=True, fit_intercept=True,
                                max_iter=1000, normalize=False, positive=False,
                                precompute=False, random_state=None,
                                selection='cyclic', tol=0.0001,
                                warm_start=False),
                max_features=None, norm_order=1, prefit=False, threshold=None)

In [18]:
model_1.get_support()

array([False,  True,  True,  True,  True])

In [19]:
# So, if you want to do feature selection, use L1 regularization
#After you find the feature, remove the fields which are not fit in the feature selection.